Обработки/Reports/_АкцииИОблигацииВСоставеАктивовПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_АкцииИОблигацииВСоставеАктивовПИФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьШапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_АкцииИОблигацииВСоставеАктивовПИФ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Акции и облигации в составе активов ПИФ",
		"1.10",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);	
	
#Область Запрос

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			ВЫБОР
		|				КОГДА &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.)
		|					ТОГДА (ВЫРАЗИТЬ(Клиент КАК Справочник.ПаевыеИнвестиционныеФонды)) = &ПаевойИнвестиционныйФонд
		|				ИНАЧЕ СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			КОНЕЦ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеОрганизации,
		|	РеквизитыЮридическихЛицОрганизации.ПолноеНаименованиеПоУставу КАК Организация,
		|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаЛицензии,
		|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Серия + "" "" + СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Номер КАК НомерЛицензии,
		|	ЮридическийАдрес.Представление КАК ЮрАдресОрганизации,
		|	Телефон.Представление КАК ТелефонОрганизации,
		|	ВебСтраница.Представление КАК СайтОрганизации,
		|	_КлиентДоверительногоУправления.Клиент.НомерПравил КАК НомерПравил,
		|	_КлиентДоверительногоУправления.Клиент.ДатаПравил КАК ДатаПравил,
		|	РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК НаименованиеФонда,
		|	_КлиентДоверительногоУправления.Клиент КАК ПИФ,
		|	_КлиентДоверительногоУправления.Клиент.Код КАК КодПИФ,
		|	_КлиентДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|				&Период,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|					И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ)) КАК СтатусыЛицензийОрганизацииСрезПоследних
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК ЮридическийАдрес
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = ЮридическийАдрес.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Телефон)) КАК Телефон
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = Телефон.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ВебСтраница)) КАК ВебСтраница
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = ВебСтраница.Объект,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления,
		|	РегистрСведений.РеквизитыПИФ.СрезПоследних(
		|			&Период,
		|			ПаевойИнвестиционныйФонд В
		|				(ВЫБРАТЬ
		|					_КлиентДоверительногоУправления.Клиент
		|				ИЗ
		|					_КлиентДоверительногоУправления)) КАК РеквизитыПИФСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РеквизитыЭмитентаНаКонец.КраткоеНаименованиеПоУставу КАК НаименованиеЭмитента,
		|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ОГРН,
		|	СУММА(СтоимостьПереоценки.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_СтоимостьПереоценки
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитентаНаКонец
		|		ПО СтоимостьПереоценки.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЭмитентаНаКонец.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)) КАК ДокументыЮридическихЛицСрезПоследних
		|		ПО СтоимостьПереоценки.ЦеннаяБумага.Эмитент.ЮрФизЛицо = ДокументыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			И (ДокументыЮридическихЛицСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует))
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.Активность
		|	И СтоимостьПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.Источник,
		|	РеквизитыЭмитентаНаКонец.КраткоеНаименованиеПоУставу,
		|	ДокументыЮридическихЛицСрезПоследних.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВТ_СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигация""
		|		КОГДА ВТ_СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ""Акция""
		|	КОНЕЦ КАК ТипЦБ,
		|	ВЫБОР
		|		КОГДА ВТ_СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА """"
		|		КОГДА ВТ_СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ВТ_СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Акции).Тип
		|	КОНЕЦ КАК Категория,
		|	ВЫБОР
		|		КОГДА ВТ_СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ВТ_СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА ВТ_СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ВТ_СтоимостьПереоценки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|	КОНЕЦ КАК ГосРегНомер,
		|	ВТ_СтоимостьПереоценки.Количество КАК Количество,
		|	ВТ_СтоимостьПереоценки.НаименованиеЭмитента КАК НаименованиеЭмитента,
		|	ВТ_СтоимостьПереоценки.ОГРН КАК ОГРН,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN
		|ИЗ
		|	ВТ_СтоимостьПереоценки КАК ВТ_СтоимостьПереоценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО ВТ_СтоимостьПереоценки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипЦБ,
		|	НаименованиеЭмитента";
		
#КонецОбласти

#Область ВыводОтчёта

	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЮрФизЛицо"					, ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд"	, ЭтотОбъект.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("Период"						, Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, Период, -2));
		
	ПакетОтчетов = Запрос.ВыполнитьПакет();
	
	Макет = ПолучитьМакет("Макет");
	ОбластьАкцииШапка 	= Макет.ПолучитьОбласть("АкцииШапка");
	ОбластьАкцииСтрока 	= Макет.ПолучитьОбласть("АкцииСтрока");
	
	ОбластьОблигацииШапка 	= Макет.ПолучитьОбласть("ОблигацииШапка");
	ОбластьОблигацииСтрока 	= Макет.ПолучитьОбласть("ОблигацииСтрока");
	
	ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка = ПакетОтчетов[1].Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		ОбластьАкцииШапка.Параметры.Заполнить(ВыборкаШапка);
		ОбластьАкцииШапка.Параметры.Дата = Формат(Период, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьАкцииШапка);
	
	ВывелиАкции = Ложь;
	ВыборкаПоказатели = ПакетОтчетов[3].Выбрать();
	Пока ВыборкаПоказатели.Следующий() Цикл
		
		Если ВыборкаПоказатели.ТипЦБ = "Облигация" Тогда
			Если Не ВывелиАкции Тогда
				ДокументРезультат.Вывести(ОбластьОблигацииШапка);
				ВывелиАкции = Истина;
			КонецЕсли;
			ОбластьОблигацииСтрока.Параметры.Заполнить(ВыборкаПоказатели);
			ДокументРезультат.Вывести(ОбластьОблигацииСтрока);
		ИначеЕсли ВыборкаПоказатели.ТипЦБ = "Акция" Тогда		
			ОбластьАкцииСтрока.Параметры.Заполнить(ВыборкаПоказатели); 						
			ДокументРезультат.Вывести(ОбластьАкцииСтрока);
		КонецЕсли;		
		
	КонецЦикла;       
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
		
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ОбластьПодвал.Параметры.Подписант 			= СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		ОбластьПодвал.Параметры.ПодписантДолжность 	= СтруктураДанныхКонтактногоЛица.Должность;	
	КонецЕсли;                                                                         	

	ДокументРезультат.Вывести(ОбластьПодвал);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), , ОриентацияСтраницы.Портрет);	
	
#КонецОбласти

	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	Период = НастройкиОтчета.Период.ДатаОкончания;
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	Результат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(Результат);
	
	Если Результат.ВысотаТаблицы < 5 Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтчета.Вставить("Результат", Результат);
	
КонецПроцедуры
